# DrawSplitLine Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeEditor..::..DrawSplitLine Method
SlabShapeEditor Class See Also
---
Draws a split line on the corresponding slab, roof or floor.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public SlabShapeCreaseArray DrawSplitLine(
	SlabShapeVertex startVertex,
	SlabShapeVertex endVertex
)
```

Visual Basic
---
```text
Public Function DrawSplitLine ( _
	startVertex As SlabShapeVertex, _
	endVertex As SlabShapeVertex _
) As SlabShapeCreaseArray
```

Visual C++
---
```text
public:
SlabShapeCreaseArray^ DrawSplitLine(
	SlabShapeVertex^ startVertex,
	SlabShapeVertex^ endVertex
)
```

# ### Parameters
startVertex
    Type: Autodesk.Revit.DB..::..SlabShapeVertexThe vertex to start the split line.
endVertex
    Type: Autodesk.Revit.DB..::..SlabShapeVertexThe vertex to end the split line.
# ### Return Value
The newly created creases.
# Remarks
Drawing a split line may result in multiple creases, for example when the line crosses existing creases or boundary edges.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the input vertex is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the input vertex is invalid. |

# See Also
SlabShapeEditor Class
Autodesk.Revit.DB Namespace